# Grotto OpenClaw baseline tools.
# This Brewfile is installed at image build time. Runtime additions should use
# the persistent /tools volume through npm, pnpm, uv, pipx, mise, cargo, or Go.

# General agent and shell tooling
brew "bat"
brew "fd"
brew "git-lfs"
brew "gh"
brew "jq"
brew "mise"
brew "pipx"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "uv"
brew "yq"

# Communications and personal-information tools
brew "gcalcli"
brew "himalaya"
brew "khal"
brew "khard"
brew "vdirsyncer"

# Structured data and records
brew "duckdb"
brew "libpq"
brew "sqlite"

# Documents, OCR, and media
brew "ffmpeg"
brew "ocrmypdf"
brew "pandoc"
brew "poppler"
brew "qpdf"
brew "tesseract"
